assets/category_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:ns1="MRWebServices"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
                   SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Body>
        <ns1:MRWebServices__search>
            <param0 xsi:type="xsd:string">{{FP_USERNAME}}</param0>
            <param1 xsi:type="xsd:string">{{FP_PASSWORD}}</param1>
            <param2 xsi:type="xsd:string"></param2>
	        <param3 xsi:type="xsd:string">SELECT mrASSIGNEES, COUNT(*) as COUNT FROM (SELECT CASE WHEN INSTR(mrASSIGNEES, ' ') = 0 THEN mrASSIGNEES ELSE SUBSTR(mrASSIGNEES, 0, INSTR(mrASSIGNEES, ' ') - 1) END AS mrASSIGNEES FROM MASTER1 WHERE {{FP_QUERY}} AND mrSTATUS='Closed') WHERE mrASSIGNEES IN ('AA_SUPPORT__bCENTER','ARD__uCATracksReports','ARD__uOur__bNorthwestern','ARD__uProspect__bManagement','Auxiliary__bServices','BusinessFacilities__uSpace','BusinessFinance__uASRSP','BusinessFinance__uAccountsPayable','BusinessFinance__uBudgetOffice','BusinessFinance__uCOA','BusinessFinance__uFinancialOpsIT','BusinessFinance__uFinancialOps__uCostStudies','BusinessFinance__uGeneralLedger','BusinessFinance__uPCard','BusinessFinance__uPurchasing','BusinessFinance__uSoftwarePurchasing','BusinessFinance__uTreasuryOps','BusinessFinance__uVendorMaintenance','Facilities__uIT__uArcGIS','Facilities__uIT__uDevelopers','Facilities__uIT__uHelpDesk','Feinberg__uIT__uAdministration','Feinberg__uIT__uAssessments','Feinberg__uIT__uCDSI','Feinberg__uIT__uClientManagement','Feinberg__uIT__uDevelopers','Feinberg__uIT__uExecSupport','Feinberg__uIT__uFieldSupport','Feinberg__uIT__uGeneral','Feinberg__uIT__uInfrastructure','Feinberg__uIT__uInfrastructure__uOps','Feinberg__uIT__uInfrastructure__uProjects','Feinberg__uIT__uInfrastructure__uServices','Feinberg__uIT__uLurieHelpDesk','Feinberg__uIT__uMedia','Feinberg__uIT__uNMHelpDesk','Feinberg__uIT__uOnboarding','Feinberg__uIT__uOrders','Feinberg__uIT__uPhoneSupport','Feinberg__uIT__uProcurement','Feinberg__uIT__uProjects','Feinberg__uIT__uReciever','Feinberg__uIT__uSWC','Feinberg__uIT__uSecurity','Feinberg__uIT__uWeb','Global__bMarketing__uDigital','Global__bMarketing__uSupport','HR__uFunctional','HR__uLearning__band__bDev','HR__uSecurity','HR__uSupport','Law__uAT','Law__uAV','Law__uFacilities','Law__uIT__uAdmins','Law__uIT__uApplication__uDevelopment','Law__uIT__uGeneral','Law__uIT__uPurchasing','NUIT__uAS__uADO__uESAF__uTechnical','NUIT__uAS__uADO__uESAF__uTechnicalReview','NUIT__uAS__uADO__uESHRS__uCAESAR__uTechnical','NUIT__uAS__uADO__uESHRS__uRO__uSOAApprovals','NUIT__uAS__uADO__uESHRS__uTechnical','NUIT__uAS__uADO__uESHRS__uTechnicalReview','NUIT__uAS__uADO__uSysDev','NUIT__uAS__uDMA__uIntegrationArchitecture','NUIT__uAS__uDataManagementAnalytics','NUIT__uAS__uESAF__uBuildManagers','NUIT__uAS__uESAF__uCATracks','NUIT__uAS__uESAF__uFM','NUIT__uAS__uESAF__uGeneralLedger','NUIT__uAS__uESAF__uGrants','NUIT__uAS__uESAF__uManagers','NUIT__uAS__uESAF__uOurNorthwestern','NUIT__uAS__uESAF__uResearchPortal','NUIT__uAS__uESAF__uSupplyChain','NUIT__uAS__uESAF__uTechApps','NUIT__uAS__uESHRS__uApproval','NUIT__uAS__uESHRS__uCAESAR__uDuplicates','NUIT__uAS__uESHRS__uCAESAR__uFunctional','NUIT__uAS__uESHRS__uCAESAR__uSecurity','NUIT__uAS__uESHRS__uFunctional','NUIT__uAS__uESHRS__uFunctionalQueueManagers','NUIT__uAS__uESHRS__uLearnNU','NUIT__uAS__uESHRS__uSecurity','NUIT__uAS__uESHRS__uWorkflow','NUIT__uAS__uIDS__uInformationSecurity','NUIT__uAS__uIdentityServices','NUIT__uAS__uPMO__uProjectManagement','NUIT__uAS__uPMO__uSystemTraining','NUIT__uAS__uSSLVPN','NUIT__uAcademicSoftwareDevelopment','NUIT__uAdmin__bFinance','NUIT__uCI__uCloudOps','NUIT__uCI__uCollaborationServices','NUIT__uCI__uMMS','NUIT__uCI__uPIPS__uAppDBAs','NUIT__uCI__uPIPS__uDAPS','NUIT__uCI__uPIPS__uHPC','NUIT__uCI__uPIPS__uInfrastructure','NUIT__uCI__uPIPS__uNewDecom','NUIT__uCI__uSO__uQualityControl','NUIT__uCI__uSO__uSOC','NUIT__uCI__uServiceOperationMgmt','NUIT__uCI__uTNS__u710Facility','NUIT__uCI__uTNS__uCellularDas','NUIT__uCI__uTNS__uDataNetwork','NUIT__uCI__uTNS__uFieldOperations','NUIT__uCI__uTNS__uFirewall','NUIT__uCI__uTNS__uNUSA','NUIT__uCI__uTNS__uRadios','NUIT__uCI__uTNS__uSSLVPN','NUIT__uCI__uTNS__uVoiceNetwork','NUIT__uCommunications','NUIT__uISO__uSecurity','NUIT__uMediaDesign__uArchitecture','NUIT__uMediaDesign__uBlueJeans','NUIT__uMediaDesign__uDesign','NUIT__uMediaDesign__uLSTS','NUIT__uMediaDesign__uLabs','NUIT__uMediaDesign__uNUAMPS','NUIT__uMediaDesign__uPanopto','NUIT__uResearchComputing','NUIT__uResearchComputing__uLabIT','NUIT__uResearchComputing__uRDSS','NUIT__uResearchComputing__uServersandApps','NUIT__uTSS__uDSS','NUIT__uTSS__uEndpointPlatforms','NUIT__uTSS__uITServiceManagement','NUIT__uTSS__uNetComm','NUIT__uTSS__uSupportServices','NUIT__uTSS__uUSSTier2','NUIT__uTeachingLearningTech','NUL__uDiscovery__bPlatform__bServices','NUL__uElectronic__bResources','NUL__uHelp__bDesk','NUL__uIT__bInfrastructure','NUL__uPhotocopiers','NUL__uPublic__bWebsite','NUL__uRepository','NUL__uSysadmin__uNetworking','NU__bSites__uCampusPress','NU__bWorkspace','ORIS__uAOPS','ORIS__uGeneral','ORIS__uSystems__uNSIS','ORIS__uSystems__ueACUC__ueIRB','Research__uOSR','SCS__uRO__uCaesar','SanFranciscoSupport','StudentAffairs__uIT__uInfrastructure','StudentAffairs__uIT__uReports','StudentAffairs__uIT__uTier__u1','StudentAffairs__uIT__uTier__u2','TEAM__uAdviseStream','TEAM__uHardinHall','TheGarage','UniversityEnrollment__uRO__uRES','UniversityEnrollment__uRO__uRegistration','UniversityEnrollment__uRO__uSecurity','Weinberg__uChemistry','Weinberg__uEconomics','Weinberg__uFunctional__bSolutions','Weinberg__uGeneral__bSupport','Weinberg__uIPR','Weinberg__uMath','Weinberg__uStudents','Weinberg__uSystem__bAdministrators','Weinberg__uWeb__bCommunications','Weinberg__uiModules__bSupport','Individual Users') GROUP BY mrASSIGNEES ORDER BY COUNT DESC FETCH NEXT 15 ROWS ONLY</param3>
        </ns1:MRWebServices__search>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>